Autodesk.Revit.DB.IFC.ExporterIFC.ExportAs2x3
Identifies if the file version being exported is IFC2x3.
Remarks:
Returns true even for alternative formats equivalent to IFC2x3, such as COBIE.
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.ExportAs2x2
Identifies if the file version being exported is IFC2x2.
Remarks:
Returns true even for alternative formats equivalent to IFC2x2, such as BCA.
Since:
2012